namespace FilmPool.DbModels
{

  public enum GenreEnum
  {
    Комедии = 1,
    Драма = 2,
    Мелодрама = 3,
    Детективы = 4,
    Документальные = 5,
    Ужасы = 6,
    Музыка = 7,
    Фантастика = 8,
    Анимация = 9,
    Биография = 10,
    Боевики = 11,
    Неопределенный = 12,
    Приключения = 13,
    ДляВзрослых = 14,
    Военные = 15,
    Семейные = 16,
    Триллер = 17,
    Фэнтези = 18,
    Вестерны = 19,
    Мистика = 20,
    Короткометражные = 21,
    Мюзиклы = 22,
    Исторические = 23,
    Нуар = 24,
  }

  public class Genre
  {
    public GenreEnum Id { get; set; }
    public string GenreName { get; set; }
  }
}
